ИСТ/dumps/14/Documents/ОказаниеУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ОказаниеУслуг</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.ОситаткиМатериалов</xr:Item>
				<xr:Item>AccumulationRegister.СтоимостьМатериалов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Мастер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПереченьНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ИСТ/dumps/14/Documents/ОказаниеУслуг/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)     
	Движения.СтоимостьМатериалов.Записывать = Истина ;
	Движения.ОситаткиМатериалов.Записывать = Истина ;
	Движения.Продажи.Записывать = Истина ;  
	
	// Создать менеджер временных таблиц 
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	#Область НоменклатураДокумента 
	Запрос = Новый Запрос; 
	// Укажем, какой менеджер временных таблиц использует этот запрос 
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ; 
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОказаниеУслугПереченьНоменклатуры.Номенклатура КАК Номенклатура,
		|	ОказаниеУслугПереченьНоменклатуры.Номенклатура.ВидНомеклатуры КАК ВидНоменклатуры,
		|	СУММА(ОказаниеУслугПереченьНоменклатуры.Количество) КАК КоличествоВДокументе,
		|	СУММА(ОказаниеУслугПереченьНоменклатуры.Сумма) КАК СуммаВДокументе
		|ПОМЕСТИТЬ НоменклатураДокумента
		|ИЗ
		|	Документ.ОказаниеУслуг.ПереченьНоменклатуры КАК ОказаниеУслугПереченьНоменклатуры
		|ГДЕ
		|	ОказаниеУслугПереченьНоменклатуры.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ОказаниеУслугПереченьНоменклатуры.Номенклатура,
		|	ОказаниеУслугПереченьНоменклатуры.Номенклатура.ВидНомеклатуры";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	#КонецОбласти 
	#Область ДвиженияДокумента
	Запрос2 = Новый Запрос; 
	Запрос2.МенеджерВременныхТаблиц = МенеджерВТ; 
	Запрос2.Текст = "ВЫБРАТЬ
	                |	НоменклатураДокумента.Номенклатура КАК Номенклатура,
	                |	НоменклатураДокумента.ВидНоменклатуры КАК ВидНоменклатуры,
	                |	НоменклатураДокумента.КоличествоВДокументе КАК КоличествоВДокументе,
	                |	НоменклатураДокумента.СуммаВДокументе КАК СуммаВДокументе,
	                |	ЕСТЬNULL(СтоимостьМатериаловОстатки.СтоимостьОстаток, 0) КАК Стоимость,
	                |	ЕСТЬNULL(ОситаткиМатериаловОстатки.КоличествоОстаток, 0) КАК Количество
	                |ИЗ
	                |	НоменклатураДокумента КАК НоменклатураДокумента
	                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьМатериалов.Остатки(
	                |				,
	                |				Материал В
	                |					(ВЫБРАТЬ
	                |						НоменклатураДокумента.Номенклатура
	                |					ИЗ
	                |						НоменклатураДокумента)) КАК СтоимостьМатериаловОстатки
	                |		ПО НоменклатураДокумента.ВидНоменклатуры = СтоимостьМатериаловОстатки.Материал
	                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОситаткиМатериалов.Остатки(
	                |				,
	                |				Материал В
	                |					(ВЫБРАТЬ
	                |						НоменклатураДокумента.Номенклатура
	                |					ИЗ
	                |						НоменклатураДокумента)) КАК ОситаткиМатериаловОстатки
	                |		ПО НоменклатураДокумента.Номенклатура = ОситаткиМатериаловОстатки.Материал" ; 
	// Установим необходимость блокировки данных в регистрах СтоимостьМатериалов и ОстаткиМатериалов 
	Движения.СтоимостьМатериалов.БлокироватьДляИзменения = Истина; 
	Движения.ОситаткиМатериалов.БлокироватьДляИзменения = Истина;
	// Запишем пустые наборы записей, чтобы читать остатки без учета данных в документе 
	Движения.СтоимостьМатериалов.Записать(); 
	Движения.ОситаткиМатериалов.Записать();
	РезультатЗапроса = Запрос2. Выполнить ( ) ; 
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.Количество = 0 Тогда 
			СтоимостьМатериала = 0 ; 
		Иначе 
			СтоимостьМатериала = ВыборкаДетальныеЗаписи.Стоимость / 
			ВыборкаДетальныеЗаписи.Количество; 
		КонецЕсли ;
		Если ВыборкаДетальныеЗаписи.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Материал Тогда 
			// Регистр ОстаткиМатериалов Расход 
			Движение = Движения.ОситаткиМатериалов.Добавить( ) ; 
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход; 
			Движение.Период = Дата; 
			Движение.Материал = ВыборкаДетальныеЗаписи.Номенклатура; 
			Движение.Склад = Склад; 
			Движение.Количество = ВыборкаДетальныеЗаписи.КоличествоВДокументе; 
			// Регистр СтоимостьМатериалов Расход 
			Движение = Движения.СтоимостьМатериалов.Добавить( ) ; 
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход; 
			Движение.Период = Дата; 
			Движение.Материал = ВыборкаДетальныеЗаписи.Номенклатура; 
			Движение.Стоимость = ВыборкаДетальныеЗаписи.КоличествоВДокументе * 
			ВыборкаДетальныеЗаписи.Стоимость; 
		КонецЕсли ; 
		// Регистр Продажи 
		Движение = Движения.Продажи.Добавить( ) ; 
		Движение.Период = Дата; 
		Движение.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура; 
		Движение.Клиент = Клиент; 
		Движение.Мастер = Мастер; 
		Движение.Количество = ВыборкаДетальныеЗаписи.КоличествоВДокументе; 
		Движение.Выручка = ВыборкаДетальныеЗаписи.СуммаВДокументе; 
		Движение.Стоимость = ВыборкаДетальныеЗаписи.Стоимость * 
		ВыборкаДетальныеЗаписи.КоличествоВДокументе; 
	КонецЦикла; 
	Движения.Записать( ) ;
	#КонецОбласти 
	#Область КонтрольОстатков
	Если Режим = РежимПроведенияДокумента.Оперативный Тогда 
		// Проверить отрицательные остатки 
		Запрос3 = Новый Запрос; 
		Запрос3.МенеджерВременныхТаблиц = МенеджерВТ; 
		Запрос3.Текст = "ВЫБРАТЬ
		                |	ОситаткиМатериаловОстатки.Материал КАК Материал,
		                |	ОситаткиМатериаловОстатки.КоличествоОстаток КАК КоличествоОстаток
		                |ИЗ
		                |	РегистрНакопления.ОситаткиМатериалов.Остатки(
		                |			,
		                |			Материал В
		                |					(ВЫБРАТЬ
		                |						НоменклатураДокумента.Номенклатура
		                |					ИЗ
		                |						НоменклатураДокумента)
		                |				И Склад = &Склад) КАК ОситаткиМатериаловОстатки
		                |ГДЕ
		                |	ОситаткиМатериаловОстатки.КоличествоОстаток" ;
		Запрос3.УстановитьПараметр( "Склад" , Склад) ; 
		РезультатЗапроса = Запрос3. Выполнить ( ) ; 
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать( ) ; 
		Пока ВыборкаДетальныеЗаписи.Следующий( ) Цикл 
			Сообщение = Новый СообщениеПользователю( ) ; 
			Сообщение.Текст = "Не хватает " + Строка( - 
			ВыборкаДетальныеЗаписи.КоличествоОстаток) + " единиц материала " "" + 
			ВыборкаДетальныеЗаписи.Материал + "" "" ; 
			Сообщение.Сообщить( ) ; 
			Отказ = Истина ; 
		КонецЦикла ; 
	КонецЕсли ;
	#КонецОбласти
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	//Для Каждого ТекСтрокаПереченьНоменклатуры Из ПереченьНоменклатуры Цикл 
	//	Если ТекСтрокаПереченьНоменклатуры.Номенклатура.ВидНомеклатуры = Перечисления.ВидыНоменклатуры.Материал Тогда 
	//		Движение = Движения.ОситаткиМатериалов.Добавить(); 
	//		Движение.ВидДвижения = ВидДвиженияНакопления.Расход; 
	//		Движение.Период = Дата; 
	//		Движение.Материал = ТекСтрокаПереченьНоменклатуры.Номенклатура; 
	//		Движение.Склад = Склад; 
	//		Движение.Количество = ТекСтрокаПереченьНоменклатуры.Количество; 
	//		// регистр СтоимостьМатериалов Расход
	//		Движение = Движения.СтоимостьМатериалов.Добавить( ) ;
	//		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	//		Движение.Период = Дата;
	//		Движение.Материал = ТекСтрокаПереченьНоменклатуры.Номенклатура;
	//		Движение.Стоимость = ТекСтрокаПереченьНоменклатуры.Количество *
	//		ТекСтрокаПереченьНоменклатуры.Стоимость;
	//	КонецЕсли ;
	//	// Регистр Продажи 
	//	Движение = Движения.Продажи.Добавить( ) ; 
	//	Движение.Период = Дата; 
	//	Движение.Номенклатура = ТекСтрокаПереченьНоменклатуры.Номенклатура; 
	//	Движение.Клиент = Клиент; 
	//	Движение.Мастер = Мастер; 
	//	Движение.Количество = ТекСтрокаПереченьНоменклатуры.Количество; 
	//	Движение.Выручка = ТекСтрокаПереченьНоменклатуры.Сумма; 
	//	Движение.Стоимость = ТекСтрокаПереченьНоменклатуры.Стоимость * 
	//	ТекСтрокаПереченьНоменклатуры.Количество;
	//КонецЦикла ; 
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ 
КонецПроцедуры
